Revit 2026 API

# FrameIsOrthonormal Method

---

Determines if this frame's basis vectors are orthonormal.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsOrthonormal()
```
```vb
Public Function IsOrthonormal As Boolean
```
```cpp
public:
bool IsOrthonormal()
```
```fsharp
member IsOrthonormal : unit -> bool
```

#### Return Value

Boolean True if this frame's basis vectors are orthonormal, false if not.

"Orthonormal" means that the three vectors are orthogonal and each of them has unit length.

#### Reference

Frame Class

Autodesk.Revit.DB Namespace